benchmark/duckdb/results/waf-counter-lag/20260502_151805/fio_seq_fill3x_4k.log
fillrun: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.42-20-ga95f8
Starting 1 process
fio: only root may flush block devices. Cache flush bypassed!
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

fillrun: (groupid=0, jobs=1): err= 0: pid=305158: Sat May  2 18:03:35 2026
  write: IOPS=427k, BW=1666MiB/s (1747MB/s)(4725GiB/2903563msec)
    slat (nsec): min=880, max=1995.0k, avg=1298.95, stdev=516.55
    clat (usec): min=14, max=2075, avg=73.32, stdev= 2.60
     lat (usec): min=15, max=2077, avg=74.62, stdev= 2.62
    clat percentiles (nsec):
     |  1.00th=[71168],  5.00th=[71168], 10.00th=[71168], 20.00th=[72192],
     | 30.00th=[72192], 40.00th=[73216], 50.00th=[73216], 60.00th=[74240],
     | 70.00th=[74240], 80.00th=[74240], 90.00th=[75264], 95.00th=[75264],
     | 99.00th=[77312], 99.50th=[77312], 99.90th=[80384], 99.95th=[87552],
     | 99.99th=[99840]
   bw (  MiB/s): min= 1629, max= 1715, per=100.00%, avg=1666.49, stdev=24.75, samples=5806
   iops        : min=417114, max=439176, avg=426621.27, stdev=6335.71, samples=5806
  lat (usec)   : 20=0.01%, 50=0.01%, 100=99.99%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=39.99%, sys=59.99%, ctx=22267, majf=0, minf=30
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1238630400,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=1666MiB/s (1747MB/s), 1666MiB/s-1666MiB/s (1747MB/s-1747MB/s), io=4725GiB (5073GB), run=2903563-2903563msec

Disk stats (read/write):
  nvme0n1: ios=129/1238561668, sectors=6408/9908493344, merge=0/0, ticks=8/10027751, in_queue=10027759, util=100.00%